/*********************************************************************************************************
* 模块名称：Timer.c
* 摘    要：Timer模块
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日  
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Timer.h"
#include "stm32f10x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 static u8 s_i2msFlag = FALSE;						//将2ms标志位的值设置为FALSE
 static u8 s_i10msFlag = FALSE;						//将10ms标志位的值设置为FALSE
 static u8 s_i1secFlag = FALSE;						//将1s标志位的值设置为FALSE
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static	void	ConfigTimer2(u16 arr,u16 psc);		//配置TIM2
static	void	ConfigTimer4(u16 arr,u16 psc);		//配置TIM4
static	void	ConfigTimer5(u16 arr,u16 psc);		//配置TIM5
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigTimer2
* 函数功能：配置TIM2
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static	void	ConfigTimer2(u16 arr,u16 psc)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;//用于存放定时器的参数
	NVIC_InitTypeDef NVIC_InitStructure;					//用于存放NVIC的参数
	//使能RCC相关时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);
	
	TIM_TimeBaseStructure.TIM_Period = arr;												//设置自动重装载值
	TIM_TimeBaseStructure.TIM_Prescaler = psc;										//设置预分频器值
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;				//设置时钟分割：他DTS= tCK_INT
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;		//设置递增计数模式
	TIM_TimeBaseInit(TIM2,&TIM_TimeBaseStructure);								//根据参数初始化定时器
	
	TIM_ITConfig(TIM2,TIM_IT_Update,ENABLE);											//使能定时器的更新中断
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;								//中断通道信号
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;			//设置抢占优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;						//设置子优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;								//使能中断
	NVIC_Init(&NVIC_InitStructure);																//根据参数初始化NVIC
	
	TIM_Cmd(TIM2,ENABLE);																					//使能定时器
}

/*********************************************************************************************************
* 函数名称：ConfigTimer4
* 函数功能：配置TIM4
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static	void	ConfigTimer4(u16 arr,u16 psc)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;//用于存放定时器的参数
	NVIC_InitTypeDef NVIC_InitStructure;					//用于存放NVIC的参数
	//使能RCC相关时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4,ENABLE);
	
	TIM_TimeBaseStructure.TIM_Period = arr;												//设置自动重装载值
	TIM_TimeBaseStructure.TIM_Prescaler = psc;										//设置预分频器值
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;				//设置时钟分割：他DTS= tCK_INT
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;		//设置递增计数模式
	TIM_TimeBaseInit(TIM4,&TIM_TimeBaseStructure);								//根据参数初始化定时器
	
	TIM_ITConfig(TIM4,TIM_IT_Update,ENABLE);											//使能定时器的更新中断
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM4_IRQn;								//中断通道信号
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;			//设置抢占优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;						//设置子优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;								//使能中断
	NVIC_Init(&NVIC_InitStructure);																//根据参数初始化NVIC
	
	TIM_Cmd(TIM4,ENABLE);																					//使能定时器
}

/*********************************************************************************************************
* 函数名称：ConfigTimer5
* 函数功能：配置TIM5
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static	void	ConfigTimer5(u16 arr,u16 psc)
{
	TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;//用于存放定时器的参数
	NVIC_InitTypeDef NVIC_InitStructure;					//用于存放NVIC的参数
	//使能RCC相关时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5,ENABLE);
	
	TIM_TimeBaseStructure.TIM_Period = arr;												//设置自动重装载值
	TIM_TimeBaseStructure.TIM_Prescaler = psc;										//设置预分频器值
	TIM_TimeBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;				//设置时钟分割：tDTS= tCK_INT
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;		//设置递增计数模式
	TIM_TimeBaseInit(TIM5,&TIM_TimeBaseStructure);								//根据参数初始化定时器
	
	TIM_ITConfig(TIM5,TIM_IT_Update,ENABLE);											//使能定时器的更新中断
	
	NVIC_InitStructure.NVIC_IRQChannel = TIM5_IRQn;								//中断通道信号
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;			//设置抢占优先级
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;						//设置子优先级
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;								//使能中断
	NVIC_Init(&NVIC_InitStructure);																//根据参数初始化NVIC
	
	TIM_Cmd(TIM5,ENABLE);																					//使能定时器
}
/*********************************************************************************************************
* 函数名称：TIM2_IRQHandler
* 函数功能：Timer2的中断服务函数
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void TIM2_IRQHandler(void)
{
	static u16 s_iCnt2 = 0;														//定义一个静态变量s_iCnt2作为2ms计数器
	if(TIM_GetITStatus(TIM2,TIM_FLAG_Update) == SET)	//判断定时器更新中断是否发生
	{
		TIM_ClearITPendingBit(TIM2,TIM_FLAG_Update);		//清除定时器更新中断标志
	}
	s_iCnt2++;																				//2ms计数器的计数值加1
	if(s_iCnt2 >= 2)																	//2ms计数器的计数值大于或等于2
	{
		s_iCnt2 = 0;																		//重置2ms计数器的计数值为0
		s_i2msFlag = TRUE;															//将2ms标志位的值设置为TRUE
	}
}
/*********************************************************************************************************
* 函数名称：TIM2_IRQHandler
* 函数功能：Timer2的中断服务函数
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void TIM4_IRQHandler(void)
{
	static u16 s_iCnt10 = 0;														//定义一个静态变量s_iCnt10作为10ms计数器
	if(TIM_GetITStatus(TIM4,TIM_FLAG_Update) == SET)	//判断定时器更新中断是否发生
	{
		TIM_ClearITPendingBit(TIM4,TIM_FLAG_Update);		//清除定时器更新中断标志
	}
	s_iCnt10++;																				//10ms计数器的计数值加1
	if(s_iCnt10 >= 10)																	//10ms计数器的计数值大于或等于10
	{
		s_iCnt10 = 0;																		//重置10ms计数器的计数值为0
		s_i10msFlag = TRUE;															//将10ms标志位的值设置为TRUE
	}
}
/*********************************************************************************************************
* 函数名称：TIM5_IRQHandler
* 函数功能：Timer2的中断服务函数
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void TIM5_IRQHandler(void)
{
	static u16 s_iCnt1000 = 0;														//定义一个静态变量s_iCnt1000作为1s计数器
	if(TIM_GetITStatus(TIM5,TIM_FLAG_Update) == SET)			//判断定时器更新中断是否发生
	{
		TIM_ClearITPendingBit(TIM5,TIM_FLAG_Update);				//清除定时器更新中断标志
	}
	s_iCnt1000++;																					//1000ms计数器的计数值加1
	if(s_iCnt1000 >= 1000)																//1000ms计数器的计数值大于或等于1000
	{
		s_iCnt1000 = 0;																			//重置1000ms计数器的计数值为0
		s_i1secFlag = TRUE;																	//将1s标志位的值设置为TRUE
	}
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitTimer
* 函数功能：初始化计时器
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitTimer(void)				//初始化Timer模块
{
	ConfigTimer2(999,71);
	ConfigTimer4(999,71);
	ConfigTimer5(999,71);
}

/*********************************************************************************************************
* 函数名称：Get2msFlag
* 函数功能：获取2ms标志位的值
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
u8 Get2msFlag(void)				//获取2ms标志位的值
{
	return(s_i2msFlag);
}

/*********************************************************************************************************
* 函数名称：Clr2msFlag
* 函数功能：清除2ms标志位
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void Clr2msFlag(void)			//清除2ms标志位
{
	s_i2msFlag = FALSE;
}

/*********************************************************************************************************
* 函数名称：Get10msFlag
* 函数功能：获取2ms标志位的值
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
u8 Get10msFlag(void)				//获取10ms标志位的值
{
	return(s_i10msFlag);
}

/*********************************************************************************************************
* 函数名称：Clr10msFlag
* 函数功能：清除10ms标志位
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void Clr10msFlag(void)			//清除10ms标志位
{
	s_i10msFlag = FALSE;
}

/*********************************************************************************************************
* 函数名称：Get1SecFlag
* 函数功能：获取2ms标志位的值
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
u8 Get1SecFlag(void)				//获取2ms标志位的值
{
	return(s_i1secFlag);
}

/*********************************************************************************************************
* 函数名称：Clr2msFlag
* 函数功能：清除2ms标志位
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void Clr1SecFlag(void)			//清除2ms标志位
{
	s_i1secFlag = FALSE;
}

