/*********************************************************************************************************
* 模块名称：
* 摘    要：
* 当前版本：1.0.0
* 作    者：SZLY(COPYRIGHT 2018 - 2020 SZLY. All rights reserved.)
* 完成日期：2020年01月01日  
* 内    容：
* 注    意：                                                                  
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "LED.h"
#include "stm32f10x_gpio.h"
//或者   #include "stm32f10x_conf.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
 
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void ConfigLEDGPIO(void); //配置LED的GPIO
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigLEDGPIO
* 函数功能：
* 输入参数：
* 输出参数：
* 返 回 值：
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
static void ConfigLEDGPIO(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;	//GPIO_InitStructure用于存放GPIO的参数
	
	//使能RCC相关时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);//使能GPIOC的时钟
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_4;					//设置引脚
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		//设置I/O口输出速度
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_Out_PP;		//设置模式
	GPIO_Init(GPIOC,&GPIO_InitStructure);								//根据参数初始化LED1的GPIO
	
	GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);						//将LED1默认状态设置为点亮
	
	GPIO_InitStructure.GPIO_Pin		= GPIO_Pin_5;					//设置引脚，通过修改GPIO_InitStructure结构体
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		//设置I/O口输出速度
	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_Out_PP;		//设置模式
	GPIO_Init(GPIOC,&GPIO_InitStructure);								//根据参数初始化LED2的GPIO
	
	GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);					//将LED2默认状态设置为熄灭
}
/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitLED
* 函数功能：LED模块初始化函数，调用ConfigLEDGPIO函数实现对LED模块的初始化
* 输入参数：void
* 输出参数：void
* 返 回 值：无
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void InitLED(void)
{
	ConfigLEDGPIO();
}
/*********************************************************************************************************
* 函数名称：LEDFlicker(u16 cnt)
* 函数功能：LED的闪烁函数，通过改变GPIO引脚电平实现LED的闪烁，其参数cnt用于控制闪烁的周期，亮起2*cnt毫秒，熄灭2*cnt毫秒
* 输入参数：u16 cnt
* 输出参数：void
* 返 回 值：无
* 创建日期：2018年01月01日
* 注    意：
*********************************************************************************************************/
void LEDFlicker(u16 cnt)
{	static u16 state = 0;
	static u16 s_iCnt;		//定义静态变量s_iCnt作为计数器
	s_iCnt++;							//计数器的计数值+1
	if(s_iCnt >= cnt)
	{
		s_iCnt = 0;					//重置计数器的计数值为0
		
		switch(state)
		{
			case 0:
				//LED1状态0	
				GPIO_WriteBit(GPIOC,GPIO_Pin_4,(BitAction)0);
				//LED2状态0
				GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);
				state++;break;
			case 1:
				//LED1状态0	
				GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_RESET);
				//LED2状态1
				GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_SET);
				state++;break;
			case 2:
				//LED1状态1	
				GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);
				//LED2状态0
				GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_RESET);
				state++;break;
			case 3:
				//LED1状态1	
				GPIO_WriteBit(GPIOC,GPIO_Pin_4,Bit_SET);
				//LED2状态1
				GPIO_WriteBit(GPIOC,GPIO_Pin_5,Bit_SET);
				state=0;break;
			default:break;
		}
	}
}
